Revit 2027 API
Truss.DetachChord Method
Detach a truss's specific chord from the element to which it is attached.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DetachChord(
	TrussChordLocation location
)
Public Sub DetachChord (
	location As TrussChordLocation
)
public:
void DetachChord(
	TrussChordLocation location
)
member DetachChord :
        location : TrussChordLocation -> unit
Parameters
location TrussChordLocation
The chord.
See Also
Reference
Truss Class
Autodesk.Revit.DB.Structure Namespace